GopalSaraf/Practicals/PSDL/include/proc/pic18c801.inc
// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0F9Fh
// bitfield definitions
IPR1_TMR1IP_POSN                         equ 0000h
IPR1_TMR1IP_POSITION                     equ 0000h
IPR1_TMR1IP_SIZE                         equ 0001h
IPR1_TMR1IP_LENGTH                       equ 0001h
IPR1_TMR1IP_MASK                         equ 0001h
IPR1_TMR2IP_POSN                         equ 0001h
IPR1_TMR2IP_POSITION                     equ 0001h
IPR1_TMR2IP_SIZE                         equ 0001h
IPR1_TMR2IP_LENGTH                       equ 0001h
IPR1_TMR2IP_MASK                         equ 0002h
IPR1_CCP1IP_POSN                         equ 0002h
IPR1_CCP1IP_POSITION                     equ 0002h
IPR1_CCP1IP_SIZE                         equ 0001h
IPR1_CCP1IP_LENGTH                       equ 0001h
IPR1_CCP1IP_MASK                         equ 0004h
IPR1_SSPIP_POSN                          equ 0003h
IPR1_SSPIP_POSITION                      equ 0003h
IPR1_SSPIP_SIZE                          equ 0001h
IPR1_SSPIP_LENGTH                        equ 0001h
IPR1_SSPIP_MASK                          equ 0008h
IPR1_TXIP_POSN                           equ 0004h
IPR1_TXIP_POSITION                       equ 0004h
IPR1_TXIP_SIZE                           equ 0001h
IPR1_TXIP_LENGTH                         equ 0001h
IPR1_TXIP_MASK                           equ 0010h
IPR1_RCIP_POSN                           equ 0005h
IPR1_RCIP_POSITION                       equ 0005h
IPR1_RCIP_SIZE                           equ 0001h
IPR1_RCIP_LENGTH                         equ 0001h
IPR1_RCIP_MASK                           equ 0020h
IPR1_ADIP_POSN                           equ 0006h
IPR1_ADIP_POSITION                       equ 0006h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0040h
IPR1_TX1IP_POSN                          equ 0004h
IPR1_TX1IP_POSITION                      equ 0004h
IPR1_TX1IP_SIZE                          equ 0001h
IPR1_TX1IP_LENGTH                        equ 0001h
IPR1_TX1IP_MASK                          equ 0010h
IPR1_RC1IP_POSN                          equ 0005h
IPR1_RC1IP_POSITION                      equ 0005h
IPR1_RC1IP_SIZE                          equ 0001h
IPR1_RC1IP_LENGTH                        equ 0001h
IPR1_RC1IP_MASK                          equ 0020h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0FA0h
// bitfield definitions
PIE2_CCP2IE_POSN                         equ 0000h
PIE2_CCP2IE_POSITION                     equ 0000h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0001h
PIE2_TMR3IE_POSN                         equ 0001h
PIE2_TMR3IE_POSITION                     equ 0001h
PIE2_TMR3IE_SIZE                         equ 0001h
PIE2_TMR3IE_LENGTH                       equ 0001h
PIE2_TMR3IE_MASK                         equ 0002h
PIE2_LVDIE_POSN                          equ 0002h
PIE2_LVDIE_POSITION                      equ 0002h
PIE2_LVDIE_SIZE                          equ 0001h
PIE2_LVDIE_LENGTH                        equ 0001h
PIE2_LVDIE_MASK                          equ 0004h
PIE2_BCLIE_POSN                          equ 0003h
PIE2_BCLIE_POSITION                      equ 0003h
PIE2_BCLIE_SIZE                          equ 0001h
PIE2_BCLIE_LENGTH                        equ 0001h
PIE2_BCLIE_MASK                          equ 0008h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0FA1h
// bitfield definitions
PIR2_CCP2IF_POSN                         equ 0000h
PIR2_CCP2IF_POSITION                     equ 0000h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0001h
PIR2_TMR3IF_POSN                         equ 0001h
PIR2_TMR3IF_POSITION                     equ 0001h
PIR2_TMR3IF_SIZE                         equ 0001h
PIR2_TMR3IF_LENGTH                       equ 0001h
PIR2_TMR3IF_MASK                         equ 0002h
PIR2_LVDIF_POSN                          equ 0002h
PIR2_LVDIF_POSITION                      equ 0002h
PIR2_LVDIF_SIZE                          equ 0001h
PIR2_LVDIF_LENGTH                        equ 0001h
PIR2_LVDIF_MASK                          equ 0004h
PIR2_BCLIF_POSN                          equ 0003h
PIR2_BCLIF_POSITION                      equ 0003h
PIR2_BCLIF_SIZE                          equ 0001h
PIR2_BCLIF_LENGTH                        equ 0001h
PIR2_BCLIF_MASK                          equ 0008h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0FA2h
// bitfield definitions
IPR2_CCP2IP_POSN                         equ 0000h
IPR2_CCP2IP_POSITION                     equ 0000h
IPR2_CCP2IP_SIZE                         equ 0001h
IPR2_CCP2IP_LENGTH                       equ 0001h
IPR2_CCP2IP_MASK                         equ 0001h
IPR2_TMR3IP_POSN                         equ 0001h
IPR2_TMR3IP_POSITION                     equ 0001h
IPR2_TMR3IP_SIZE                         equ 0001h
IPR2_TMR3IP_LENGTH                       equ 0001h
IPR2_TMR3IP_MASK                         equ 0002h
IPR2_LVDIP_POSN                          equ 0002h
IPR2_LVDIP_POSITION                      equ 0002h
IPR2_LVDIP_SIZE                          equ 0001h
IPR2_LVDIP_LENGTH                        equ 0001h
IPR2_LVDIP_MASK                          equ 0004h
IPR2_BCLIP_POSN                          equ 0003h
IPR2_BCLIP_POSITION                      equ 0003h
IPR2_BCLIP_SIZE                          equ 0001h
IPR2_BCLIP_LENGTH                        equ 0001h
IPR2_BCLIP_MASK                          equ 0008h

// Register: CSELIO
#define CSELIO CSELIO
CSELIO                                   equ 0FA6h
// bitfield definitions
CSELIO_CSIO_POSN                         equ 0000h
CSELIO_CSIO_POSITION                     equ 0000h
CSELIO_CSIO_SIZE                         equ 0008h
CSELIO_CSIO_LENGTH                       equ 0008h
CSELIO_CSIO_MASK                         equ 00FFh
CSELIO_CSIO0_POSN                        equ 0000h
CSELIO_CSIO0_POSITION                    equ 0000h
CSELIO_CSIO0_SIZE                        equ 0001h
CSELIO_CSIO0_LENGTH                      equ 0001h
CSELIO_CSIO0_MASK                        equ 0001h
CSELIO_CSIO1_POSN                        equ 0001h
CSELIO_CSIO1_POSITION                    equ 0001h
CSELIO_CSIO1_SIZE                        equ 0001h
CSELIO_CSIO1_LENGTH                      equ 0001h
CSELIO_CSIO1_MASK                        equ 0002h
CSELIO_CSIO2_POSN                        equ 0002h
CSELIO_CSIO2_POSITION                    equ 0002h
CSELIO_CSIO2_SIZE                        equ 0001h
CSELIO_CSIO2_LENGTH                      equ 0001h
CSELIO_CSIO2_MASK                        equ 0004h
CSELIO_CSIO3_POSN                        equ 0003h
CSELIO_CSIO3_POSITION                    equ 0003h
CSELIO_CSIO3_SIZE                        equ 0001h
CSELIO_CSIO3_LENGTH                      equ 0001h
CSELIO_CSIO3_MASK                        equ 0008h
CSELIO_CSIO4_POSN                        equ 0004h
CSELIO_CSIO4_POSITION                    equ 0004h
CSELIO_CSIO4_SIZE                        equ 0001h
CSELIO_CSIO4_LENGTH                      equ 0001h
CSELIO_CSIO4_MASK                        equ 0010h
CSELIO_CSIO5_POSN                        equ 0005h
CSELIO_CSIO5_POSITION                    equ 0005h
CSELIO_CSIO5_SIZE                        equ 0001h
CSELIO_CSIO5_LENGTH                      equ 0001h
CSELIO_CSIO5_MASK                        equ 0020h
CSELIO_CSIO6_POSN                        equ 0006h
CSELIO_CSIO6_POSITION                    equ 0006h
CSELIO_CSIO6_SIZE                        equ 0001h
CSELIO_CSIO6_LENGTH                      equ 0001h
CSELIO_CSIO6_MASK                        equ 0040h
CSELIO_CSIO7_POSN                        equ 0007h
CSELIO_CSIO7_POSITION                    equ 0007h
CSELIO_CSIO7_SIZE                        equ 0001h
CSELIO_CSIO7_LENGTH                      equ 0001h
CSELIO_CSIO7_MASK                        equ 0080h

